---
kind: property
id: P:Autodesk.Revit.DB.Visual.Metal.MetalPatternScale
source: html/6da2e871-288f-cc21-fc05-7c232df01362.htm
---
# Autodesk.Revit.DB.Visual.Metal.MetalPatternScale Property

The property labeled "Scale" from the "Metal" schema.

## Syntax (C#)
```csharp
public static string MetalPatternScale { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" with a minimum of "0".